src/test/java/org/smooks/cartridges/templating/stringtemplate/acmesecsample/AcmeFindaddressRequest.tran.expected.xml

<!--
  ========================LICENSE_START=================================
  Smooks Templating Cartridge
  %%
  Copyright (C) 2020 - 2023 Smooks
  %%
  Licensed under the terms of the Apache License Version 2.0, or
  the GNU Lesser General Public License version 3.0 or later.
  
  SPDX-License-Identifier: Apache-2.0 OR LGPL-3.0-or-later
  
  ======================================================================
  
  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at
  
      http://www.apache.org/licenses/LICENSE-2.0
  
  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.
  
  ======================================================================
  
  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 3 of the License, or (at your option) any later version.
  
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.
  
  You should have received a copy of the GNU Lesser General Public License
  along with this program; if not, write to the Free Software Foundation,
  Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
  =========================LICENSE_END==================================
  -->
<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:m0="http://schemas.acme.com/addressfinder/" xmlns:m1="http://schemas.acme.com/addressmanager/"
                   xmlns:wsa="http://www.w3.org/2005/03/addressing" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

    <SOAP-ENV:Header>
        <wsa:MessageID>9ccdc110-b5e1-11da-bb6e-e2761a0ce10a</wsa:MessageID>
        <wsa:Action>urn:x-acme:servicetype:Address:findAddresses</wsa:Action>
        <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext">
            <wsse:UsernameToken>
                <wsse:Username>johnnym</wsse:Username>
                <wsse:Password>guessagain</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <m:findAddresses SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:m="v2">
            <addresses SOAP-ENC:arrayType="m0:Address[1]" xsi:type="SOAP-ENC:Array">
                <m0:item0 xsi:type="m0:Address">
                    <houseNumber>380</houseNumber>
                    <street>New York St.</street>
                    <city>Redlands</city>
                    <state_prov>CA</state_prov>
                    <zone>92373</zone>
                    <country>US</country>
                </m0:item0>
                <m0:item1 xsi:type="m0:Address">
                    <street>1000 Main St.</street>
                    <country>US</country>
                </m0:item1>
            </addresses>
            <addressManagerOptions xsi:type="m1:AddressManagerOptions">
                <dataSource xsi:type="xsd:string">GDT.Address.US</dataSource>
            </addressManagerOptions>
            <token xsi:type="xsd:string">MyToken</token>
        </m:findAddresses>
    </SOAP-ENV:Body>

</SOAP-ENV:Envelope>
